app/controllers/cards_controller.rb

  def index
    if params[:search]
      @cards = Card.search(params[:search]).order("created_at DESC")
    else
      @cards = Card.all
---
SELECT `cards`.* FROM `cards`