app/controllers/users_controller.rb

INSERT INTO `users` (`name`, `lastname`, `email`, `phone`, `cellphone`, `cpf`, `cep`, `number`, `complement`, `password`, `created_at`, `updated_at`) VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
	def create
		@user = User.new(user_params)
		@user.password = params[:user][:password]
		if @user.save